a1 = float (input ('Введіть першу координату вектора а: '))
a2 = float(input ('Введіть другу координату вектора а: '))
a3 = float(input ('Введіть третю координату вектора а: '))
b1 = float(input ('Введіть першу координату вектора b: '))
b2 = float(input ('Введіть другу координату вектора b: '))
b3 = float(input ('Введіть третю координату вектора b: ')) 
if a1 / b1 == a2 / b2:
    if a2 / b2 == a3 / b3:
          print ("Вектори а і b колінеарні")
    else:
        print ("Вектори а і b не колінеарні")
else:
    print ("Вектори а і b не колінеарні")